Repository: yaqubroli/VBASync
Catalog: src/VBASync/Localization/VBASyncResources.*.resx
Languages: fr

# ApplyAction
source: _Apply
fr: _Appliquer

# BrowseAction
source: _Browse
fr: _Parcourir

# CancelAction
source: Cancel
fr: Annuler

# CTAddFile
source: Add file
fr: Ajouter un fichier

# CTAddLines
source: Add
fr: Ajouter

# CTAddSub
source: Add Sub
fr: Ajouter Sub

# CTChangeFileType
source: Module type
fr: Type de module

# CTChangeFormControls
source: Form design
fr: UserForm FRX

# CTChangeLines
source: Change
fr: Changement

# CTDeleteFile
source: Delete file
fr: Suppr. fichier

# CTDeleteFrx
source: Delete form design
fr: Suppr. UserForm FRX

# CTDeleteLines
source: Delete
fr: Supprimer

# CTDeleteSub
source: Delete Sub
fr: Supprimer Sub

# CTMoveFile
source: Rename file
fr: Renommer le fichier

# CTMoveSub
source: Move Sub
fr: Déplacer Sub

# CTProject
source: Project
fr: Projet

# CTReplaceId
source: Replace
fr: Remplacer

# MTForm
source: Form
fr: UserForm

# MWExitMenu
source: E_xit
fr: _Quitter

# MWExtract
source: E_xtract VBA from Office file
fr: E_xtraire le VBA du fichier Office

# MWFileMenu
source: _File
fr: _Fichier

# MWLoadLastMenu
source: _Load last session
fr: _Charger la dernière session

# MWLoadSessionMenu
source: _Open session
fr: _Ouvrir session

# MWOfficeFile
source: _Office file
fr: Fichier _Office

# MWOpenAllFiles
source: All files
fr: Tous les fichiers

# MWOpenAllSupported
source: All supported files
fr: Tous les types supportés

# MWOpenExcel07
source: Excel 2007+ files
fr: Fichiers Excel 2007+

# MWOpenExcel97
source: Excel 97-2003 files
fr: Fichiers Excel 97-2003

# MWOpenOutlook
source: Outlook files
fr: Fichiers Outlook

# MWOpenPpt07
source: PowerPoint 2007+ files
fr: Fichiers PowerPoint 2007+

# MWOpenSAlone
source: Stand-alone VBA project
fr: Projet VBA autonome

# MWOpenSession
source: Session files
fr: Fichiers session

# MWOpenWord07
source: Word 2007+ files
fr: Fichiers Word 2007+

# MWOpenWord97
source: Word 97-2003 files
fr: Fichiers Word 97-2003

# MWPublish
source: _Publish VBA to Office file
fr: Pu_blier les modifications VBA vers le fichier Office

# MWRefreshAction
source: _Refresh
fr: _Rafraichir

# MWSaveSessionMenu
source: _Save session
fr: _Sauvegarder la session

# MWSettingsMenu
source: _Settings
fr: _Options

# MWVBAFolder
source: _VBA project folder
fr: _Dossier du projet VBA

# SWDiffTool
source: _Diff tool (optional)
fr: _Outil de Diff (optionnel)

# SWDiffToolParameters
source: D_iff tool parameters
fr: Paramètres de l'outil de D_iff

# SWDiffToolParametersHelp
source: Macros: {OldFile}, {NewFile}
fr: Macros: {OldFile}, {NewFile} (Ancien Fichier, Nouveau Fichier)

# SWTitle
source: Settings
fr: Options

# CDChangeFileType
source: {0} → {1} and file changed ({2})
fr: {0} → {1} et fichier modifié ({2})

# CDWholeFile
source: File changed ({0})
fr: Fichier modifié ({0})

# ErrorCannotFindVbaProject
source: Cannot find 'vbaProject.bin' in ZIP archive.
fr: 'vbaProject.bin' non trouvé dans l'archive ZIP (le fichier Office).

# ErrorDecompressingStream
source: Error while decompressing stream '{0}': {1}
fr: Erreur lors de la décompression du flux '{0}': {1}

# ErrorFrxColorSizeMismatch
source: Error creating OleColor: expected 4 bytes but saw {0} bytes as read.
fr: Erreur lors de la création d'OleColor: 4 octets attendus, mais {0} octets lus.

# ErrorFrxExpectedEndOfOleSiteConcreteControl
source: Expected end of OleSiteConcreteControl.
fr: Fin attendue d'OleSiteConcreteControl.

# ErrorFrxStreamSizeMismatch
source: Error reading '{0}' stream in .frx data: expected {1} size {2}, but saw {3} bytes as read.
fr: Erreur de lecture du flux '{0}' dans les données .frx : le champ {1} doit faire {2} octets, mais {3} octets lus.

# ErrorPathCannotbeNullOrEmpty
source: Path to file cannot be null or empty.
fr: Le chemin d'accès au fichier ne doit pas être null ou vide.

# ErrorUnrecognizedModuleType
source: Unrecognized module type.
fr: Type de module non reconnu.

# ExplainFrxDifferentFileLists
source: Different stream lists in storage '{0}'. File 1: {{'{1}'}} File 2: {{'{2}'}}
fr: Listes de flux différentes dans le stockage '{0}'. Fichier 1 : {{'{1}'}} Fichier 2 : {{'{2}'}}

# ExplainFrxGeneralStreamDifference
source: Different contents of stream '{0}' in storage '{1}'.
fr: Contenus différents du flux '{0}' dans le stockage '{1}'.

# ExplainFrxOStreamDifference
source: Different contents of stream 'o', site '{0}' in storage '{1}'.
fr: Contenus différents du flux 'o', site '{0}' dans le stockage '{1}'.

# SWLanguage
source: _Language (requires restart)
fr: _Langue (redémarrage nécessaire)

# AWTitle
source: About VBA Sync Tool
fr: À propos de VBA Sync Tool

# AWCopyright
source: Copyright © {0} Chelsea Hughes. See {1} for more details.
fr: Droits d'auteur © {0} Chelsea Hughes. Pour plus de détails, lisez le fichier {1}

# AWWebsite
source: Visit {0} for support.
fr: Support du logiciel sur le site {0}

# AWWTFIsThis
source: Synchronizes macros from an Office VBA-enabled file with a version-controlled folder.
fr: Synchronise les macros VBA d'un fichier Office avec un dossier, typiquement suivi par un système de gestion de configuration (Git, SVN, etc.).

# MWAboutMenu
source: _About VBA Sync Tool
fr: À propos de VBA Sync Tool (_A)

# MWHelpMenu
source: _Help
fr: Aide (_H)

# ExplainFrxTitle
source: FRX file difference
fr: Différence dans le fichier FRX

# MWEditMenu
source: _Edit
fr: Édition (_E)

# ErrorCannotLoadGUI
source: Cannot load WPF UI. If your system is non-Windows or otherwise doesn't support WPF, you may only run VBA Sync Tool by specifying -r on the command-line.
fr: Impossible de charger l'interface WPF. Si votre système n'est pas Windows ou ne supporte par le WPF, vous ne pouvez exécuter VBASync qu'en spécifiant -r en ligne de commande.

# SWAddNewDocumentsToFile
source: Allow adding new document modules when publishing (expert option)
fr: Autoriser l'ajout de nouveaux modules de type documents lors de la publication (option expert)

# SWGeneralTab
source: General
fr: Général

# SWIgnoreEmpty
source: Ignore empty modules
fr: Ignorer les modules vides

# SWAfterExtractHook
source: After-extract hook
fr: Hook post-extraction

# SWBeforePublishHook
source: Before-publish hook
fr: Hook pré-publication

# SWDeleteDocumentsFromFile
source: Allow deleting document modules when publishing (expert option)
fr: Autoriser la suppression de modules de type document lors de la publication (option expert)

# SWSearchRepositorySubdirectories
source: Search subdirectories of VBA project folder
fr: Rechercher dans les sous dossiers du projet VBA
